Repository: Sanjarbek-Usmonov/MPEI
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: about_university
uz: Universitet haqida

source: User
uz: Tizim foydalanuvchilari

source: Text
uz: Matn

source: created_at
uz: -da hosil qilindi

source: updated_at
uz: -da tahrirlandi

source: Introducing with MPEI
uz: MPEI bilan tanishtirish

source: Full name
uz: To'liq ismi sharif

source: Subject
uz: Mavzu

source: Email
uz: Elektron pochta

source: Contact
uz: Bog'lanish

source: Legal info
uz: MPEI yuridik ma ºlumotlari

source: WEB resources
uz: WEB manbalari

source: Partners
uz: Hamkorlar

source: Degree
uz: Ilmiy daraja

source: image
uz: Rasm

source: Honorary people
uz: Faxriy shaxslar

source: Uzbek
uz: O'zbek

source: English
uz: Ingliz

source: Russian
uz: Rus

source: education
uz: Ta'lim

source: Name
uz: Nomi

source: Faculties
uz: Fakultetlar

source: Groups
uz: Guruhlar

source: Upload file
uz: Faylni yuklash

source: Schedule
uz: Jadval

source: Basic education programs
uz: Asosiy ta'lim dasturlari

source: Training results
uz: Trening natijalari

source: Additional education
uz: Qo'shimcha ta'lim

source: Distance education
uz: Masofaviy ta'lim

source: Employment and internship
uz: Ishga joylashish va amaliyot

source: Final qualifiers
uz: Yakuniy saralash

source: Official documents
uz: Rasmiy hujjatlar

source: Science and Innovation
uz: Ilm-fan va innovatsiyalar

source: Research and development
uz: Tadqiqot va ishlanmalar

source: Scientific infrastructure
uz: Ilmiy infratuzilma

source: State scientific certificate
uz: Davlat ilmiy sertifikati

source: Journals
uz: Jurnallar

source: Scientific event detail
uz: Ilmiy tadbir tafsiloti

source: Scientific events
uz: Ilmiy tadbirlar
